Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
:35:01.817 STDOUT terraform1.11.0:                         }
17:35:01.817 STDOUT terraform1.11.0:                     }
17:35:01.817 STDOUT terraform1.11.0:                 )
17:35:01.817 STDOUT terraform1.11.0:               - version        = "9.4.4"
17:35:01.817 STDOUT terraform1.11.0:             },
17:35:01.817 STDOUT terraform1.11.0:         ] -> (known after apply)
17:35:01.817 STDOUT terraform1.11.0:         name                       = "clickhouse"
17:35:01.817 STDOUT terraform1.11.0:       ~ values                     = [
17:35:01.817 STDOUT terraform1.11.0:           # Warning: this attribute value will no longer be marked as sensitive
17:35:01.817 STDOUT terraform1.11.0:           # after applying this change.
17:35:01.817 STDOUT terraform1.11.0:           ~ (sensitive value),
17:35:01.817 STDOUT terraform1.11.0:         ]
17:35:01.817 STDOUT terraform1.11.0:         # (27 unchanged attributes hidden)
17:35:01.817 STDOUT terraform1.11.0:     }
17:35:01.817 STDOUT terraform1.11.0:   # helm_release.postgresql will be updated in-place
17:35:01.817 STDOUT terraform1.11.0:   ~ resource "helm_release" "postgresql" {
17:35:01.817 STDOUT terraform1.11.0:         id                         = "postgresql"
17:35:01.817 STDOUT terraform1.11.0:       ~ metadata                   = [
17:35:01.817 STDOUT terraform1.11.0:           - {
17:35:01.817 STDOUT terraform1.11.0:               - app_version    = "17.2.0"
17:35:01.818 STDOUT terraform1.11.0:               - chart          = "postgresql"
17:35:01.818 STDOUT terraform1.11.0:               - first_deployed = 1765656834
17:35:01.818 STDOUT terraform1.11.0:               - last_deployed  = 1766458899
17:35:01.818 STDOUT terraform1.11.0:               - name           = "postgresql"
17:35:01.818 STDOUT terraform1.11.0:               - namespace      = "data-prod"
17:35:01.818 STDOUT terraform1.11.0:               - notes          = <<-EOT
17:35:01.818 STDOUT terraform1.11.0:                     CHART NAME: postgresql
17:35:01.818 STDOUT terraform1.11.0:                     CHART VERSION: 16.4.2
17:35:01.818 STDOUT terraform1.11.0:                     APP VERSION: 17.2.0
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                     Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                     ** Please be patient while the chart is being deployed **
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                     PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                         postgresql.data-prod.svc.cluster.local - Read/Write connection
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                     To get the password for "postgres" run:
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                         export POSTGRES_PASSWORD=$(kubectl get secret --namespace data-prod postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                     To connect to your database run the following command:
17:35:01.818 STDOUT terraform1.11.0:                     
17:35:01.818 STDOUT terraform1.11.0:                         kubectl run postgresql-client --rm --tty -i --restart='Never' --namespace data-prod --image docker.io/bitnami/postgresql:latest --env="PGPASSWORD=$POSTGRES_PASSWORD" \
17:35:01.819 STDOUT terraform1.11.0:                           --command -- psql --host postgresql -U postgres -d app -p 5432
17:35:01.819 STDOUT terraform1.11.0:                     
17:35:01.819 STDOUT terraform1.11.0:                         > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
17:35:01.819 STDOUT terraform1.11.0:                     
17:35:01.819 STDOUT terraform1.11.0:                     To connect to your database from outside the cluster execute the following commands:
17:35:01.819 STDOUT terraform1.11.0:                     
17:35:01.819 STDOUT terraform1.11.0:                         kubectl port-forward --namespace data-prod svc/postgresql 5432:5432 &
17:35:01.819 STDOUT terraform1.11.0:                         PGPASSWORD="$POSTGRES_PASSWORD" psql --host 127.0.0.1 -U postgres -d app -p 5432
17:35:01.819 STDOUT terraform1.11.0:                     
17:35:01.819 STDOUT terraform1.11.0:                     WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
17:35:01.819 STDOUT terraform1.11.0:                     WARNING: Rolling tag detected (bitnami/postgresql:latest), please note that it is strongly recommended to avoid using rolling tags in a production environment.
17:35:01.819 STDOUT terraform1.11.0:                     +info https://techdocs.broadcom.com/us/en/vmware-tanzu/application-catalog/tanzu-application-catalog/services/tac-doc/apps-tutorials-understand-rolling-tags-containers-index.html
17:35:01.819 STDOUT terraform1.11.0:                     
17:35:01.819 STDOUT terraform1.11.0:                     WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
17:35:01.819 STDOUT terraform1.11.0:                       - readReplicas.resources
17:35:01.819 STDOUT terraform1.11.0:                     +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
17:35:01.819 STDOUT terraform1.11.0:                     
17:35:01.820 STDOUT terraform1.11.0:                     ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
17:35:01.820 STDOUT terraform1.11.0:                     
17:35:01.820 STDOUT terraform1.11.0:                     Substituted images detected:
17:35:01.820 STDOUT terraform1.11.0:                       - docker.io/bitnami/postgresql:latest
17:35:01.820 STDOUT terraform1.11.0:                     
17:35:01.820 STDOUT terraform1.11.0:                     ⚠ WARNING: Original containers have been retagged. Please note this Helm chart was tested, and validated on multiple platforms using a specific set of Tanzu Application Catalog containers. Substituting original image tags could cause unexpected behavior.
17:35:01.820 STDOUT terraform1.11.0:                     
17:35:01.820 STDOUT terraform1.11.0:                     Retagged images:
17:35:01.820 STDOUT terraform1.11.0:                       - docker.io/bitnami/postgresql:latest
17:35:01.820 STDOUT terraform1.11.0:                 EOT
17:35:01.820 STDOUT terraform1.11.0:               - revision       = 5
17:35:01.820 STDOUT terraform1.11.0:               - values         = jsonencode(
17:35:01.820 STDOUT terraform1.11.0:                     {
17:35:01.820 STDOUT terraform1.11.0:                       - auth    = {
17:35:01.820 STDOUT terraform1.11.0:                           - database         = "app"
17:35:01.820 STDOUT terraform1.11.0:                           - postgresPassword = "ohb8G9tZEt1qKoWrXHCqEPBA"
17:35:01.820 STDOUT terraform1.11.0:                         }
17:35:01.820 STDOUT terraform1.11.0:                       - image   = {
17:35:01.820 STDOUT terraform1.11.0:                           - pullPolicy = "IfNotPresent"
17:35:01.820 STDOUT terraform1.11.0:                           - tag        = "latest"
17:35:01.820 STDOUT terraform1.11.0:                         }
17:35:01.820 STDOUT terraform1.11.0:                       - primary = {
17:35:01.820 STDOUT terraform1.11.0:                           - initContainers = [
17:35:01.820 STDOUT terraform1.11.0:                               - {
17:35:01.820 STDOUT terraform1.11.0:                                   - command = [
17:35:01.821 STDOUT terraform1.11.0:                                       - "sh",
17:35:01.821 STDOUT terraform1.11.0:                                       - "-c",
17:35:01.821 STDOUT terraform1.11.0:                                       - "t=120;e=0;until nc -z vault.platform.svc.cluster.local 8200;do echo \"waiting for Vault... ($e/$t s)\";sleep 2;e=$((e+2));[ $e -ge $t ]&&exit 1;done",
17:35:01.821 STDOUT terraform1.11.0:                                     ]
17:35:01.821 STDOUT terraform1.11.0:                                   - image   = "busybox:1.36"
17:35:01.821 STDOUT terraform1.11.0:                                   - name    = "wait-for-vault"
17:35:01.821 STDOUT terraform1.11.0:                                 },
17:35:01.821 STDOUT terraform1.11.0:                             ]
17:35:01.821 STDOUT terraform1.11.0:                           - persistence    = {
17:35:01.821 STDOUT terraform1.11.0:                               - enabled      = true
17:35:01.821 STDOUT terraform1.11.0:                               - size         = "10Gi"
17:35:01.821 STDOUT terraform1.11.0:                               - storageClass = "local-path-retain"
17:35:01.821 STDOUT terraform1.11.0:                             }
17:35:01.821 STDOUT terraform1.11.0:                           - resources      = {
17:35:01.821 STDOUT terraform1.11.0:                               - limits   = {
17:35:01.821 STDOUT terraform1.11.0:                                   - cpu    = "500m"
17:35:01.821 STDOUT terraform1.11.0:                                   - memory = "512Mi"
17:35:01.821 STDOUT terraform1.11.0:                                 }
17:35:01.821 STDOUT terraform1.11.0:                               - requests = {
17:35:01.821 STDOUT terraform1.11.0:                                   - cpu    = "100m"
17:35:01.822 STDOUT terraform1.11.0:                                   - memory = "128Mi"
17:35:01.822 STDOUT terraform1.11.0:                                 }
17:35:01.822 STDOUT terraform1.11.0:                             }
17:35:01.822 STDOUT terraform1.11.0:                         }
17:35:01.822 STDOUT terraform1.11.0:                     }
17:35:01.822 STDOUT terraform1.11.0:                 )
17:35:01.822 STDOUT terraform1.11.0:               - version        = "16.4.2"
17:35:01.822 STDOUT terraform1.11.0:             },
17:35:01.822 STDOUT terraform1.11.0:         ] -> (known after apply)
17:35:01.822 STDOUT terraform1.11.0:         name                       = "postgresql"
17:35:01.822 STDOUT terraform1.11.0:       ~ values                     = [
17:35:01.822 STDOUT terraform1.11.0:           # Warning: this attribute value will no longer be marked as sensitive
17:35:01.822 STDOUT terraform1.11.0:           # after applying this change.
17:35:01.822 STDOUT terraform1.11.0:           ~ (sensitive value),
17:35:01.822 STDOUT terraform1.11.0:         ]
17:35:01.822 STDOUT terraform1.11.0:         # (27 unchanged attributes hidden)
17:35:01.822 STDOUT terraform1.11.0:     }
17:35:01.822 STDOUT terraform1.11.0:   # helm_release.redis will be updated in-place
17:35:01.823 STDOUT terraform1.11.0:   ~ resource "helm_release" "redis" {
17:35:01.823 STDOUT terraform1.11.0:         id                         = "redis"
17:35:01.823 STDOUT terraform1.11.0:       ~ metadata                   = [
17:35:01.823 STDOUT terraform1.11.0:           - {
17:35:01.823 STDOUT terraform1.11.0:               - app_version    = "7.4.1"
17:35:01.823 STDOUT terraform1.11.0:               - chart          = "redis"
17:35:01.823 STDOUT terraform1.11.0:               - first_deployed = 1765804342
17:35:01.823 STDOUT terraform1.11.0:               - last_deployed  = 1766458900
17:35:01.823 STDOUT terraform1.11.0:               - name           = "redis"
17:35:01.823 STDOUT terraform1.11.0:               - namespace      = "data-prod"
17:35:01.823 STDOUT terraform1.11.0:               - notes          = <<-EOT
17:35:01.823 STDOUT terraform1.11.0:                     CHART NAME: redis
17:35:01.823 STDOUT terraform1.11.0:                     CHART VERSION: 20.6.0
17:35:01.823 STDOUT terraform1.11.0:                     APP VERSION: 7.4.1
17:35:01.823 STDOUT terraform1.11.0:                     
17:35:01.823 STDOUT terraform1.11.0:                     Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                     ** Please be patient while the chart is being deployed **
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                     Redis&reg; can be accessed on the following DNS names from within your cluster:
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                         redis-master.data-prod.svc.cluster.local for read/write operations (port 6379)
17:35:01.824 STDOUT terraform1.11.0:                         redis-replicas.data-prod.svc.cluster.local for read-only operations (port 6379)
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                     To get your password run:
17:35:01.824 STDOUT terraform1.11.0:                     
17:35:01.824 STDOUT terraform1.11.0:                         export REDIS_PASSWORD=$(kubectl get secret --namespace data-prod redis -o jsonpath="{.data.redis-password}" | base64 -d)
17:35:01.825 STDOUT terraform1.11.0:                     
17:35:01.825 STDOUT terraform1.11.0:                     To connect to your Redis&reg; server:
17:35:01.825 STDOUT terraform1.11.0:                     
17:35:01.825 STDOUT terraform1.11.0:                     1. Run a Redis&reg; pod that you can use as a client:
17:35:01.825 STDOUT terraform1.11.0:                     
17:35:01.825 STDOUT terraform1.11.0:                        kubectl run --namespace data-prod redis-client --restart='Never'  --env REDIS_PASSWORD=$REDIS_PASSWORD  --image docker.io/bitnami/redis:latest --command -- sleep infinity
17:35:01.825 STDOUT terraform1.11.0:                     
17:35:01.825 STDOUT terraform1.11.0:                        Use the following command to attach to the pod:
17:35:01.825 STDOUT terraform1.11.0:                     
17:35:01.825 STDOUT terraform1.11.0:                        kubectl exec --tty -i redis-client \
17:35:01.825 STDOUT terraform1.11.0:                        --namespace data-prod -- bash
17:35:01.825 STDOUT terraform1.11.0:                     
17:35:01.825 STDOUT terraform1.11.0:                     2. Connect using the Redis&reg; CLI:
17:35:01.825 STDOUT terraform1.11.0:                        REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h redis-master
17:35:01.825 STDOUT terraform1.11.0:                        REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h redis-replicas
17:35:01.826 STDOUT terraform1.11.0:                     
17:35:01.826 STDOUT terraform1.11.0:                     To connect to your database from outside the cluster execute the following commands:
17:35:01.826 STDOUT terraform1.11.0:                     
17:35:01.826 STDOUT terraform1.11.0:                         kubectl port-forward --namespace data-prod svc/redis-master 6379:6379 &
17:35:01.826 STDOUT terraform1.11.0:                         REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h 127.0.0.1 -p 6379
17:35:01.826 STDOUT terraform1.11.0:                     WARNING: Rolling tag detected (bitnami/redis:latest), please note that it is strongly recommended to avoid using rolling tags in a production environment.
17:35:01.826 STDOUT terraform1.11.0:                     +info https://techdocs.broadcom.com/us/en/vmware-tanzu/application-catalog/tanzu-application-catalog/services/tac-doc/apps-tutorials-understand-rolling-tags-containers-index.html
17:35:01.826 STDOUT terraform1.11.0:                     
17:35:01.826 STDOUT terraform1.11.0:                     ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
17:35:01.826 STDOUT terraform1.11.0:                     
17:35:01.826 STDOUT terraform1.11.0:                     Substituted images detected:
17:35:01.826 STDOUT terraform1.11.0:                       - docker.io/bitnami/redis:latest
17:35:01.826 STDOUT terraform1.11.0:                     
17:35:01.826 STDOUT terraform1.11.0:                     ⚠ WARNING: Original containers have been retagged. Please note this Helm chart was tested, and validated on multiple platforms using a specific set of Tanzu Application Catalog containers. Substituting original image tags could cause unexpected behavior.
17:35:01.827 STDOUT terraform1.11.0:                     
17:35:01.827 STDOUT terraform1.11.0:                     Retagged images:
17:35:01.827 STDOUT terraform1.11.0:                       - docker.io/bitnami/redis:latest
17:35:01.827 STDOUT terraform1.11.0:                 EOT
17:35:01.827 STDOUT terraform1.11.0:               - revision       = 3
17:35:01.827 STDOUT terraform1.11.0:               - values         = jsonencode(
17:35:01.827 STDOUT terraform1.11.0:                     {
17:35:01.827 STDOUT terraform1.11.0:                       - auth    = {
17:35:01.827 STDOUT terraform1.11.0:                           - password = "6DB3iiwWwt77XR2ltSFKFLKi2dWGPbox"
17:35:01.827 STDOUT terraform1.11.0:                         }
17:35:01.827 STDOUT terraform1.11.0:                       - image   = {
17:35:01.827 STDOUT terraform1.11.0:                           - pullPolicy = "IfNotPresent"
17:35:01.827 STDOUT terraform1.11.0:                           - tag        = "latest"
17:35:01.827 STDOUT terraform1.11.0:                         }
17:35:01.827 STDOUT terraform1.11.0:                       - master  = {
17:35:01.827 STDOUT terraform1.11.0:                           - configuration = <<-EOT
17:35:01.827 STDOUT terraform1.11.0:                                 appendonly yes
17:35:01.827 STDOUT terraform1.11.0:                                 appendfsync everysec
17:35:01.827 STDOUT terraform1.11.0:                                 save 900 1
17:35:01.827 STDOUT terraform1.11.0:                                 save 300 10
17:35:01.827 STDOUT terraform1.11.0:                                 save 60 10000
17:35:01.827 STDOUT terraform1.11.0:                             EOT
17:35:01.827 STDOUT terraform1.11.0:                           - persistence   = {
17:35:01.827 STDOUT terraform1.11.0:                               - enabled      = true
17:35:01.827 STDOUT terraform1.11.0:                               - size         = "2Gi"
17:35:01.827 STDOUT terraform1.11.0:                               - storageClass = "local-path-retain"
17:35:01.827 STDOUT terraform1.11.0:                             }
17:35:01.827 STDOUT terraform1.11.0:                           - resources     = {
17:35:01.828 STDOUT terraform1.11.0:                               - limits   = {
17:35:01.828 STDOUT terraform1.11.0:                                   - cpu    = "200m"
17:35:01.828 STDOUT terraform1.11.0:                                   - memory = "256Mi"
17:35:01.828 STDOUT terraform1.11.0:                                 }
17:35:01.828 STDOUT terraform1.11.0:                               - requests = {
17:35:01.828 STDOUT terraform1.11.0:                                   - cpu    = "50m"
17:35:01.828 STDOUT terraform1.11.0:                                   - memory = "64Mi"
17:35:01.828 STDOUT terraform1.11.0:                                 }
17:35:01.828 STDOUT terraform1.11.0:                             }
17:35:01.828 STDOUT terraform1.11.0:                         }
17:35:01.828 STDOUT terraform1.11.0:                       - replica = {
17:35:01.828 STDOUT terraform1.11.0:                           - replicaCount = 0
17:35:01.828 STDOUT terraform1.11.0:                         }
17:35:01.828 STDOUT terraform1.11.0:                     }
17:35:01.828 STDOUT terraform1.11.0:                 )
17:35:01.828 STDOUT terraform1.11.0:               - version        = "20.6.0"
17:35:01.828 STDOUT terraform1.11.0:             },
17:35:01.828 STDOUT terraform1.11.0:         ] -> (known after apply)
17:35:01.828 STDOUT terraform1.11.0:         name                       = "redis"
17:35:01.828 STDOUT terraform1.11.0:       ~ values                     = [
17:35:01.828 STDOUT terraform1.11.0:           # Warning: this attribute value will no longer be marked as sensitive
17:35:01.828 STDOUT terraform1.11.0:           # after applying this change.
17:35:01.829 STDOUT terraform1.11.0:           ~ (sensitive value),
17:35:01.829 STDOUT terraform1.11.0:         ]
17:35:01.829 STDOUT terraform1.11.0:         # (27 unchanged attributes hidden)
17:35:01.829 STDOUT terraform1.11.0:     }
17:35:01.829 STDOUT terraform1.11.0:   # kubectl_manifest.arangodb_deployment will be updated in-place
17:35:01.829 STDOUT terraform1.11.0:   ~ resource "kubectl_manifest" "arangodb_deployment" {
17:35:01.829 STDOUT terraform1.11.0:         id                      = "/apis/database.arangodb.com/v1/namespaces/data-prod/arangodeployments/arangodb"
17:35:01.829 STDOUT terraform1.11.0:         name                    = "arangodb"
17:35:01.829 STDOUT terraform1.11.0:       ~ yaml_body               = (sensitive value)
17:35:01.829 STDOUT terraform1.11.0:       ~ yaml_body_parsed        = <<-EOT
17:35:01.829 STDOUT terraform1.11.0:             apiVersion: database.arangodb.com/v1
17:35:01.829 STDOUT terraform1.11.0:             kind: ArangoDeployment
17:35:01.829 STDOUT terraform1.11.0:             metadata:
17:35:01.829 STDOUT terraform1.11.0:               name: arangodb
17:35:01.829 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.829 STDOUT terraform1.11.0:             spec:
17:35:01.829 STDOUT terraform1.11.0:               auth:
17:35:01.829 STDOUT terraform1.11.0:           -     jwtSecretName: arangodb-jwt
17:35:01.829 STDOUT terraform1.11.0:           +     jwtSecretName: arangodb-credentials
17:35:01.829 STDOUT terraform1.11.0:               image: arangodb/arangodb:3.11.8
17:35:01.829 STDOUT terraform1.11.0:               mode: Single
17:35:01.829 STDOUT terraform1.11.0:               single:
17:35:01.829 STDOUT terraform1.11.0:                 count: 1
17:35:01.829 STDOUT terraform1.11.0:                 resources:
17:35:01.829 STDOUT terraform1.11.0:                   limits:
17:35:01.829 STDOUT terraform1.11.0:                     cpu: 500m
17:35:01.829 STDOUT terraform1.11.0:                     memory: 512Mi
17:35:01.829 STDOUT terraform1.11.0:                   requests:
17:35:01.829 STDOUT terraform1.11.0:                     cpu: 100m
17:35:01.829 STDOUT terraform1.11.0:                     memory: 128Mi
17:35:01.829 STDOUT terraform1.11.0:                 volumeClaimTemplate:
17:35:01.829 STDOUT terraform1.11.0:                   spec:
17:35:01.829 STDOUT terraform1.11.0:                     accessModes:
17:35:01.829 STDOUT terraform1.11.0:                     - ReadWriteOnce
17:35:01.829 STDOUT terraform1.11.0:                     resources:
17:35:01.829 STDOUT terraform1.11.0:                       requests:
17:35:01.829 STDOUT terraform1.11.0:                         storage: 5Gi
17:35:01.829 STDOUT terraform1.11.0:                     storageClassName: local-path-retain
17:35:01.829 STDOUT terraform1.11.0:         EOT
17:35:01.829 STDOUT terraform1.11.0:         # (14 unchanged attributes hidden)
17:35:01.830 STDOUT terraform1.11.0:     }
17:35:01.830 STDOUT terraform1.11.0:   # kubectl_manifest.arangodb_vault_secret will be created
17:35:01.830 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "arangodb_vault_secret" {
17:35:01.830 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:01.830 STDOUT terraform1.11.0:       + apply_only              = false
17:35:01.830 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:01.830 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:01.830 STDOUT terraform1.11.0:       + force_new               = false
17:35:01.830 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:01.830 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:01.830 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:01.830 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:01.830 STDOUT terraform1.11.0:       + name                    = "arangodb-credentials"
17:35:01.830 STDOUT terraform1.11.0:       + namespace               = "data-prod"
17:35:01.830 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:01.830 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:01.830 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:01.830 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:01.830 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:01.830 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:01.830 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:01.830 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:01.830 STDOUT terraform1.11.0:             metadata:
17:35:01.830 STDOUT terraform1.11.0:               name: arangodb-credentials
17:35:01.830 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.830 STDOUT terraform1.11.0:             spec:
17:35:01.830 STDOUT terraform1.11.0:               destination:
17:35:01.830 STDOUT terraform1.11.0:                 create: true
17:35:01.830 STDOUT terraform1.11.0:                 name: arangodb-credentials
17:35:01.830 STDOUT terraform1.11.0:               mount: secret
17:35:01.830 STDOUT terraform1.11.0:               path: arangodb
17:35:01.830 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:01.830 STDOUT terraform1.11.0:               type: kv-v2
17:35:01.831 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:01.831 STDOUT terraform1.11.0:         EOT
17:35:01.831 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:01.831 STDOUT terraform1.11.0:     }
17:35:01.831 STDOUT terraform1.11.0:   # kubectl_manifest.clickhouse_vault_secret will be created
17:35:01.831 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "clickhouse_vault_secret" {
17:35:01.831 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:01.831 STDOUT terraform1.11.0:       + apply_only              = false
17:35:01.831 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:01.831 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:01.831 STDOUT terraform1.11.0:       + force_new               = false
17:35:01.831 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:01.831 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:01.831 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:01.831 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:01.831 STDOUT terraform1.11.0:       + name                    = "clickhouse-credentials"
17:35:01.831 STDOUT terraform1.11.0:       + namespace               = "data-prod"
17:35:01.831 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:01.831 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:01.831 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:01.831 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:01.831 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:01.831 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:01.831 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:01.831 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:01.831 STDOUT terraform1.11.0:             metadata:
17:35:01.831 STDOUT terraform1.11.0:               name: clickhouse-credentials
17:35:01.832 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.832 STDOUT terraform1.11.0:             spec:
17:35:01.832 STDOUT terraform1.11.0:               destination:
17:35:01.832 STDOUT terraform1.11.0:                 create: true
17:35:01.832 STDOUT terraform1.11.0:                 name: clickhouse-credentials
17:35:01.832 STDOUT terraform1.11.0:               mount: secret
17:35:01.832 STDOUT terraform1.11.0:               path: clickhouse
17:35:01.832 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:01.832 STDOUT terraform1.11.0:               type: kv-v2
17:35:01.832 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:01.832 STDOUT terraform1.11.0:         EOT
17:35:01.832 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:01.832 STDOUT terraform1.11.0:     }
17:35:01.832 STDOUT terraform1.11.0:   # kubectl_manifest.openpanel_postgres_init will be created
17:35:01.832 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "openpanel_postgres_init" {
17:35:01.832 STDOUT terraform1.11.0:       + api_version             = "batch/v1"
17:35:01.832 STDOUT terraform1.11.0:       + apply_only              = false
17:35:01.832 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:01.832 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:01.832 STDOUT terraform1.11.0:       + force_new               = false
17:35:01.832 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:01.832 STDOUT terraform1.11.0:       + kind                    = "Job"
17:35:01.832 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:01.832 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:01.832 STDOUT terraform1.11.0:       + name                    = "openpanel-postgres-init"
17:35:01.832 STDOUT terraform1.11.0:       + namespace               = "data-prod"
17:35:01.832 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:01.832 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:01.832 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:01.832 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:01.832 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:01.832 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:01.833 STDOUT terraform1.11.0:             apiVersion: batch/v1
17:35:01.833 STDOUT terraform1.11.0:             kind: Job
17:35:01.833 STDOUT terraform1.11.0:             metadata:
17:35:01.833 STDOUT terraform1.11.0:               labels:
17:35:01.833 STDOUT terraform1.11.0:                 app: openpanel
17:35:01.833 STDOUT terraform1.11.0:                 purpose: db-init
17:35:01.833 STDOUT terraform1.11.0:               name: openpanel-postgres-init
17:35:01.833 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.833 STDOUT terraform1.11.0:             spec:
17:35:01.833 STDOUT terraform1.11.0:               backoffLimit: 3
17:35:01.833 STDOUT terraform1.11.0:               template:
17:35:01.833 STDOUT terraform1.11.0:                 spec:
17:35:01.833 STDOUT terraform1.11.0:                   containers:
17:35:01.833 STDOUT terraform1.11.0:                   - args:
17:35:01.833 STDOUT terraform1.11.0:                     - -c
17:35:01.833 STDOUT terraform1.11.0:                     - |
17:35:01.833 STDOUT terraform1.11.0:                       set -e
17:35:01.833 STDOUT terraform1.11.0:                       echo "Waiting for PostgreSQL..."
17:35:01.833 STDOUT terraform1.11.0:                       until pg_isready -h postgresql -U postgres -t 5; do sleep 2; done
17:35:01.833 STDOUT terraform1.11.0:             
17:35:01.833 STDOUT terraform1.11.0:                       echo "Creating OpenPanel user..."
17:35:01.833 STDOUT terraform1.11.0:                       psql -h postgresql -U postgres -tc "SELECT 1 FROM pg_roles WHERE rolname='openpanel'" | grep -q 1 || \
17:35:01.833 STDOUT terraform1.11.0:                         psql -h postgresql -U postgres -c "CREATE USER openpanel WITH PASSWORD '$OPENPANEL_PASSWORD';"
17:35:01.833 STDOUT terraform1.11.0:             
17:35:01.833 STDOUT terraform1.11.0:                       echo "Creating OpenPanel database..."
17:35:01.833 STDOUT terraform1.11.0:                       psql -h postgresql -U postgres -tc "SELECT 1 FROM pg_database WHERE datname='openpanel'" | grep -q 1 || \
17:35:01.833 STDOUT terraform1.11.0:                         psql -h postgresql -U postgres -c "CREATE DATABASE openpanel OWNER openpanel;"
17:35:01.833 STDOUT terraform1.11.0:             
17:35:01.833 STDOUT terraform1.11.0:                       echo "OpenPanel PostgreSQL setup complete"
17:35:01.833 STDOUT terraform1.11.0:                     command:
17:35:01.833 STDOUT terraform1.11.0:                     - /bin/sh
17:35:01.833 STDOUT terraform1.11.0:                     env:
17:35:01.833 STDOUT terraform1.11.0:                     - name: PGPASSWORD
17:35:01.833 STDOUT terraform1.11.0:                       valueFrom:
17:35:01.833 STDOUT terraform1.11.0:                         secretKeyRef:
17:35:01.833 STDOUT terraform1.11.0:                           key: password
17:35:01.833 STDOUT terraform1.11.0:                           name: postgresql-credentials
17:35:01.833 STDOUT terraform1.11.0:                     - name: OPENPANEL_PASSWORD
17:35:01.833 STDOUT terraform1.11.0:                       value: FdxydwAOhPbBvygEMXHhf1R9
17:35:01.833 STDOUT terraform1.11.0:                     image: postgres:16-alpine
17:35:01.834 STDOUT terraform1.11.0:                     name: psql-init
17:35:01.834 STDOUT terraform1.11.0:                   restartPolicy: OnFailure
17:35:01.834 STDOUT terraform1.11.0:               ttlSecondsAfterFinished: 86400
17:35:01.834 STDOUT terraform1.11.0:         EOT
17:35:01.834 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:01.834 STDOUT terraform1.11.0:     }
17:35:01.834 STDOUT terraform1.11.0:   # kubectl_manifest.postgres_vault_secret will be created
17:35:01.834 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "postgres_vault_secret" {
17:35:01.834 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:01.834 STDOUT terraform1.11.0:       + apply_only              = false
17:35:01.834 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:01.834 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:01.834 STDOUT terraform1.11.0:       + force_new               = false
17:35:01.834 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:01.834 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:01.834 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:01.834 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:01.834 STDOUT terraform1.11.0:       + name                    = "postgresql-credentials"
17:35:01.835 STDOUT terraform1.11.0:       + namespace               = "data-prod"
17:35:01.835 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:01.835 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:01.835 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:01.835 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:01.835 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:01.835 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:01.835 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:01.835 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:01.835 STDOUT terraform1.11.0:             metadata:
17:35:01.835 STDOUT terraform1.11.0:               name: postgresql-credentials
17:35:01.835 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.835 STDOUT terraform1.11.0:             spec:
17:35:01.835 STDOUT terraform1.11.0:               destination:
17:35:01.835 STDOUT terraform1.11.0:                 create: true
17:35:01.835 STDOUT terraform1.11.0:                 name: postgresql-credentials
17:35:01.835 STDOUT terraform1.11.0:               mount: secret
17:35:01.835 STDOUT terraform1.11.0:               path: postgres
17:35:01.835 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:01.835 STDOUT terraform1.11.0:               type: kv-v2
17:35:01.835 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:01.835 STDOUT terraform1.11.0:         EOT
17:35:01.835 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:01.835 STDOUT terraform1.11.0:     }
17:35:01.835 STDOUT terraform1.11.0:   # kubectl_manifest.redis_vault_secret will be created
17:35:01.835 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "redis_vault_secret" {
17:35:01.835 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:01.835 STDOUT terraform1.11.0:       + apply_only              = false
17:35:01.835 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:01.835 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:01.835 STDOUT terraform1.11.0:       + force_new               = false
17:35:01.835 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:01.835 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:01.835 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:01.836 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:01.836 STDOUT terraform1.11.0:       + name                    = "redis-credentials"
17:35:01.836 STDOUT terraform1.11.0:       + namespace               = "data-prod"
17:35:01.836 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:01.836 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:01.836 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:01.836 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:01.836 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:01.836 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:01.836 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:01.836 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:01.836 STDOUT terraform1.11.0:             metadata:
17:35:01.836 STDOUT terraform1.11.0:               name: redis-credentials
17:35:01.836 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.836 STDOUT terraform1.11.0:             spec:
17:35:01.836 STDOUT terraform1.11.0:               destination:
17:35:01.836 STDOUT terraform1.11.0:                 create: true
17:35:01.836 STDOUT terraform1.11.0:                 name: redis-credentials
17:35:01.836 STDOUT terraform1.11.0:               mount: secret
17:35:01.836 STDOUT terraform1.11.0:               path: redis
17:35:01.836 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:01.836 STDOUT terraform1.11.0:               type: kv-v2
17:35:01.836 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:01.836 STDOUT terraform1.11.0:         EOT
17:35:01.836 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:01.836 STDOUT terraform1.11.0:     }
17:35:01.836 STDOUT terraform1.11.0:   # kubectl_manifest.vault_auth will be created
17:35:01.836 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "vault_auth" {
17:35:01.836 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:01.836 STDOUT terraform1.11.0:       + apply_only              = false
17:35:01.837 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:01.837 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:01.837 STDOUT terraform1.11.0:       + force_new               = false
17:35:01.837 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:01.837 STDOUT terraform1.11.0:       + kind                    = "VaultAuth"
17:35:01.837 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:01.837 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:01.837 STDOUT terraform1.11.0:       + name                    = "default"
17:35:01.837 STDOUT terraform1.11.0:       + namespace               = "data-prod"
17:35:01.837 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:01.837 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:01.837 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:01.837 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:01.837 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:01.837 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:01.837 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:01.837 STDOUT terraform1.11.0:             kind: VaultAuth
17:35:01.838 STDOUT terraform1.11.0:             metadata:
17:35:01.838 STDOUT terraform1.11.0:               name: default
17:35:01.838 STDOUT terraform1.11.0:               namespace: data-prod
17:35:01.838 STDOUT terraform1.11.0:             spec:
17:35:01.838 STDOUT terraform1.11.0:               kubernetes:
17:35:01.838 STDOUT terraform1.11.0:                 audiences:
17:35:01.838 STDOUT terraform1.11.0:                 - vault
17:35:01.838 STDOUT terraform1.11.0:                 role: vault-secrets-operator
17:35:01.838 STDOUT terraform1.11.0:                 serviceAccount: default
17:35:01.838 STDOUT terraform1.11.0:               method: kubernetes
17:35:01.838 STDOUT terraform1.11.0:               mount: kubernetes
17:35:01.838 STDOUT terraform1.11.0:         EOT
17:35:01.838 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:01.838 STDOUT terraform1.11.0:     }
17:35:01.838 STDOUT terraform1.11.0:   # kubernetes_secret.arangodb_jwt will be destroyed
17:35:01.838 STDOUT terraform1.11.0:   # (because kubernetes_secret.arangodb_jwt is not in configuration)
17:35:01.838 STDOUT terraform1.11.0:   - resource "kubernetes_secret" "arangodb_jwt" {
17:35:01.838 STDOUT terraform1.11.0:       - binary_data_wo                 = (write-only attribute) -> null
17:35:01.838 STDOUT terraform1.11.0:       - data                           = (sensitive value) -> null
17:35:01.838 STDOUT terraform1.11.0:       - data_wo                        = (write-only attribute) -> null
17:35:01.838 STDOUT terraform1.11.0:       - id                             = "data-prod/arangodb-jwt" -> null
17:35:01.838 STDOUT terraform1.11.0:       - immutable                      = false -> null
17:35:01.838 STDOUT terraform1.11.0:       - type                           = "Opaque" -> null
17:35:01.838 STDOUT terraform1.11.0:       - wait_for_service_account_token = true -> null
17:35:01.839 STDOUT terraform1.11.0:       - metadata {
17:35:01.839 STDOUT terraform1.11.0:           - annotations      = {} -> null
17:35:01.839 STDOUT terraform1.11.0:           - generation       = 0 -> null
17:35:01.839 STDOUT terraform1.11.0:           - labels           = {} -> null
17:35:01.839 STDOUT terraform1.11.0:           - name             = "arangodb-jwt" -> null
17:35:01.839 STDOUT terraform1.11.0:           - namespace        = "data-prod" -> null
17:35:01.839 STDOUT terraform1.11.0:           - resource_version = "2250074" -> null
17:35:01.839 STDOUT terraform1.11.0:           - uid              = "737ae3f8-b3f9-492e-b06b-3fa4c8b2054f" -> null
17:35:01.839 STDOUT terraform1.11.0:             # (1 unchanged attribute hidden)
17:35:01.839 STDOUT terraform1.11.0:         }
17:35:01.839 STDOUT terraform1.11.0:     }
17:35:01.839 STDOUT terraform1.11.0:   # time_sleep.wait_for_arangodb_secret will be created
17:35:01.839 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_arangodb_secret" {
17:35:01.839 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:01.839 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:01.839 STDOUT terraform1.11.0:     }
17:35:01.839 STDOUT terraform1.11.0:   # time_sleep.wait_for_clickhouse_secret will be created
17:35:01.839 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_clickhouse_secret" {
17:35:01.839 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:01.839 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:01.839 STDOUT terraform1.11.0:     }
17:35:01.839 STDOUT terraform1.11.0:   # time_sleep.wait_for_postgres_secret will be created
17:35:01.839 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_postgres_secret" {
17:35:01.840 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:01.840 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:01.840 STDOUT terraform1.11.0:     }
17:35:01.840 STDOUT terraform1.11.0:   # time_sleep.wait_for_redis_secret will be created
17:35:01.840 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_redis_secret" {
17:35:01.840 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:01.840 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:01.840 STDOUT terraform1.11.0:     }
17:35:01.840 STDOUT terraform1.11.0:   # time_sleep.wait_for_vso will be created
17:35:01.840 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_vso" {
17:35:01.840 STDOUT terraform1.11.0:       + create_duration = "10s"
17:35:01.840 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:01.840 STDOUT terraform1.11.0:     }
17:35:01.840 STDOUT terraform1.11.0:   # vault_database_secret_backend_connection.postgres will be created
17:35:01.840 STDOUT terraform1.11.0:   + resource "vault_database_secret_backend_connection" "postgres" {
17:35:01.840 STDOUT terraform1.11.0:       + allowed_roles     = [
17:35:01.840 STDOUT terraform1.11.0:           + "postgres-readonly",
17:35:01.840 STDOUT terraform1.11.0:           + "postgres-readwrite",
17:35:01.840 STDOUT terraform1.11.0:         ]
17:35:01.840 STDOUT terraform1.11.0:       + backend           = "database"
17:35:01.840 STDOUT terraform1.11.0:       + id                = (known after apply)
17:35:01.840 STDOUT terraform1.11.0:       + name              = "postgres"
17:35:01.840 STDOUT terraform1.11.0:       + plugin_name       = (known after apply)
17:35:01.840 STDOUT terraform1.11.0:       + verify_connection = true
17:35:01.840 STDOUT terraform1.11.0:       + postgresql {
17:35:01.840 STDOUT terraform1.11.0:           + connection_url          = (sensitive value)
17:35:01.840 STDOUT terraform1.11.0:           + max_open_connections    = 2
17:35:01.840 STDOUT terraform1.11.0:           + password_authentication = "password"
17:35:01.840 STDOUT terraform1.11.0:         }
17:35:01.840 STDOUT terraform1.11.0:     }
17:35:01.840 STDOUT terraform1.11.0:   # vault_database_secret_backend_role.postgres_readonly will be created
17:35:01.841 STDOUT terraform1.11.0:   + resource "vault_database_secret_backend_role" "postgres_readonly" {
17:35:01.841 STDOUT terraform1.11.0:       + backend               = "database"
17:35:01.841 STDOUT terraform1.11.0:       + creation_statements   = [
17:35:01.841 STDOUT terraform1.11.0:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
17:35:01.841 STDOUT terraform1.11.0:           + "GRANT SELECT ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
17:35:01.841 STDOUT terraform1.11.0:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
17:35:01.841 STDOUT terraform1.11.0:         ]
17:35:01.841 STDOUT terraform1.11.0:       + credential_type       = (known after apply)
17:35:01.841 STDOUT terraform1.11.0:       + db_name               = "postgres"
17:35:01.841 STDOUT terraform1.11.0:       + default_ttl           = 3600
17:35:01.841 STDOUT terraform1.11.0:       + id                    = (known after apply)
17:35:01.841 STDOUT terraform1.11.0:       + max_ttl               = 86400
17:35:01.841 STDOUT terraform1.11.0:       + name                  = "postgres-readonly"
17:35:01.841 STDOUT terraform1.11.0:       + revocation_statements = [
17:35:01.841 STDOUT terraform1.11.0:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
17:35:01.841 STDOUT terraform1.11.0:           + "DROP ROLE IF EXISTS \"{{name}}\";",
17:35:01.841 STDOUT terraform1.11.0:         ]
17:35:01.841 STDOUT terraform1.11.0:     }
17:35:01.841 STDOUT terraform1.11.0:   # vault_database_secret_backend_role.postgres_readwrite will be created
17:35:01.841 STDOUT terraform1.11.0:   + resource "vault_database_secret_backend_role" "postgres_readwrite" {
17:35:01.841 STDOUT terraform1.11.0:       + backend               = "database"
17:35:01.842 STDOUT terraform1.11.0:       + creation_statements   = [
17:35:01.842 STDOUT terraform1.11.0:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
17:35:01.842 STDOUT terraform1.11.0:           + "GRANT SELECT, INSERT, UPDATE, DELETE ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
17:35:01.842 STDOUT terraform1.11.0:           + "GRANT USAGE, SELECT ON ALL SEQUENCES IN SCHEMA public TO \"{{name}}\";",
17:35:01.842 STDOUT terraform1.11.0:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
17:35:01.842 STDOUT terraform1.11.0:         ]
17:35:01.842 STDOUT terraform1.11.0:       + credential_type       = (known after apply)
17:35:01.842 STDOUT terraform1.11.0:       + db_name               = "postgres"
17:35:01.842 STDOUT terraform1.11.0:       + default_ttl           = 3600
17:35:01.842 STDOUT terraform1.11.0:       + id                    = (known after apply)
17:35:01.842 STDOUT terraform1.11.0:       + max_ttl               = 86400
17:35:01.842 STDOUT terraform1.11.0:       + name                  = "postgres-readwrite"
17:35:01.842 STDOUT terraform1.11.0:       + revocation_statements = [
17:35:01.842 STDOUT terraform1.11.0:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
17:35:01.842 STDOUT terraform1.11.0:           + "REVOKE ALL PRIVILEGES ON ALL SEQUENCES IN SCHEMA public FROM \"{{name}}\";",
17:35:01.842 STDOUT terraform1.11.0:           + "DROP ROLE IF EXISTS \"{{name}}\";",
17:35:01.842 STDOUT terraform1.11.0:         ]
17:35:01.842 STDOUT terraform1.11.0:     }
17:35:01.842 STDOUT terraform1.11.0: Plan: 20 to add, 4 to change, 1 to destroy.
17:35:01.842 STDOUT terraform1.11.0: 
17:35:01.842 STDOUT terraform1.11.0: ─────────────────────────────────────────────────────────────────────────────
17:35:01.842 STDOUT terraform1.11.0: Saved the plan to:
17:35:01.842 STDOUT terraform1.11.0: ./data-prod-default.tfplan
17:35:01.843 STDOUT terraform1.11.0: To perform exactly these actions, run the following command to apply:
17:35:01.843 STDOUT terraform1.11.0:     terraform apply "./data-prod-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p data-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252Fenvs%252Fprod%252Fdata%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p data-prod
  ```
Plan: 20 to add, 4 to change, 1 to destroy.

---
### 3. project: `platform` dir: `platform` workspace: `default`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:0a4be30 

Terragrunt already installed: terragrunt version v0.96.1

Cleaning old generated .tf files...
✅ Cleanup complete

17:34:44.927 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
17:34:45.046 INFO   terraform1.11.0: Initializing the backend...
17:34:45.142 INFO   terraform1.11.0: 
17:34:45.142 INFO   terraform1.11.0: Successfully configured the backend "s3"! Terraform will automatically
17:34:45.142 INFO   terraform1.11.0: use this backend unless the backend configuration changes.
17:34:45.305 INFO   terraform1.11.0: Initializing provider plugins...
17:34:45.305 INFO   terraform1.11.0: - terraform.io/builtin/terraform is built in to Terraform
17:34:45.305 INFO   terraform1.11.0: - Reusing previous version of mastercard/restapi from the dependency lock file
17:34:45.327 INFO   terraform1.11.0: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
17:34:45.339 INFO   terraform1.11.0: - Reusing previous version of hashicorp/random from the dependency lock file
17:34:45.350 INFO   terraform1.11.0: - Reusing previous version of hashicorp/null from the dependency lock file
17:34:45.361 INFO   terraform1.11.0: - Reusing previous version of hashicorp/vault from the dependency lock file
17:34:45.374 INFO   terraform1.11.0: - Reusing previous version of hashicorp/http from the dependency lock file
17:34:45.384 INFO   terraform1.11.0: - Reusing previous version of hashicorp/helm from the dependency lock file
17:34:45.396 INFO   terraform1.11.0: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
17:34:45.408 INFO   terraform1.11.0: - Reusing previous version of hashicorp/time from the dependency lock file
17:34:45.420 INFO   terraform1.11.0: - Reusing previous version of alekc/kubectl from the dependency lock file
17:34:46.044 INFO   terraform1.11.0: - Installing cloudflare/cloudflare v4.52.5...
17:34:47.067 INFO   terraform1.11.0: - Installed cloudflare/cloudflare v4.52.5 (self-signed, key ID C76001609EE3B136)
17:34:47.140 INFO   terraform1.11.0: - Installing hashicorp/vault v4.8.0...
17:34:47.762 INFO   terraform1.11.0: - Installed hashicorp/vault v4.8.0 (signed by HashiCorp)
17:34:47.823 INFO   terraform1.11.0: - Installing hashicorp/http v3.5.0...
17:34:48.210 INFO   terraform1.11.0: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
17:34:48.815 INFO   terraform1.11.0: - Installing mastercard/restapi v1.20.0...
17:34:49.407 INFO   terraform1.11.0: - Installed mastercard/restapi v1.20.0 (self-signed, key ID DCB8C431D71C30AB)
17:34:49.477 INFO   terraform1.11.0: - Installing hashicorp/null v3.2.4...
17:34:49.837 INFO   terraform1.11.0: - Installed hashicorp/null v3.2.4 (signed by HashiCorp)
17:34:49.902 INFO   terraform1.11.0: - Installing hashicorp/helm v2.17.0...
17:34:50.893 INFO   terraform1.11.0: - Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
17:34:50.947 INFO   terraform1.11.0: - Installing hashicorp/kubernetes v2.38.0...
17:34:51.885 INFO   terraform1.11.0: - Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
17:34:51.948 INFO   terraform1.11.0: - Installing hashicorp/time v0.13.1...
17:34:52.305 INFO   terraform1.11.0: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
17:34:52.346 INFO   terraform1.11.0: - Installing alekc/kubectl v2.1.3...
17:34:53.850 INFO   terraform1.11.0: - Installed alekc/kubectl v2.1.3 (self-signed, key ID 772FB27A86DAFCE7)
17:34:53.908 INFO   terraform1.11.0: - Installing hashicorp/random v3.7.2...
17:34:54.303 INFO   terraform1.11.0: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
17:34:54.303 INFO   terraform1.11.0: Partner and community providers are signed by their developers.
17:34:54.304 INFO   terraform1.11.0: If you'd like to know more about provider signing, you can read about it here:
17:34:54.304 INFO   terraform1.11.0: https://www.terraform.io/docs/cli/plugins/signing.html
17:34:54.304 INFO   terraform1.11.0: Terraform has made some changes to the provider dependency selections recorded
17:34:54.304 INFO   terraform1.11.0: in the .terraform.lock.hcl file. Review those changes and commit them to your
17:34:54.304 INFO   terraform1.11.0: version control system if they represent changes you intended to make.
17:34:54.304 INFO   terraform1.11.0: Terraform has been successfully initialized!
17:34:54.304 INFO   terraform1.11.0: 
17:34:54.304 INFO   terraform1.11.0: You may now begin working with Terraform. Try running "terraform plan" to see
17:34:54.304 INFO   terraform1.11.0: any changes that are required for your infrastructure. All Terraform commands
17:34:54.304 INFO   terraform1.11.0: should now work.
17:34:54.304 INFO   terraform1.11.0: If you ever set or change modules or backend configuration for Terraform,
17:34:54.304 INFO   terraform1.11.0: rerun this command to reinitialize your working directory. If you forget, other
17:34:54.304 INFO   terraform1.11.0: commands will detect it and remind you to do so if necessary.
17:34:57.339 STDOUT terraform1.11.0: terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
17:34:57.340 STDOUT terraform1.11.0: terraform_data.health_check_target[0]: Refreshing state... [id=ff153b72-191c-4599-018f-65a742e9eb4d]
17:34:57.345 STDOUT terraform1.11.0: data.vault_kv_secret_v2.signoz_clickhouse: Reading...
17:34:57.347 STDOUT terraform1.11.0: random_password.vault_oidc_client_secret[0]: Refreshing state... [id=none]
17:34:57.347 STDOUT terraform1.11.0: random_password.portal_cookie_secret[0]: Refreshing state... [id=none]
17:34:57.347 STDOUT terraform1.11.0: random_id.kubero_webhook_secret: Refreshing state... [id=dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI]
17:34:57.349 STDOUT terraform1.11.0: random_password.portal_gate_client_secret[0]: Refreshing state... [id=none]
17:34:57.350 STDOUT terraform1.11.0: random_password.kubero_oidc_client_secret[0]: Refreshing state... [id=none]
17:34:57.350 STDOUT terraform1.11.0: data.cloudflare_zone.internal: Reading...
17:34:57.350 STDOUT terraform1.11.0: random_password.dashboard_oidc_client_secret[0]: Refreshing state... [id=none]
17:34:57.353 STDOUT terraform1.11.0: random_id.kubero_session_secret: Refreshing state... [id=zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc]
17:34:57.364 STDOUT terraform1.11.0: vault_identity_group.admin[0]: Refreshing state... [id=0ac3b38e-52bb-3a86-d72d-71ad31784ee3]
17:34:57.364 STDOUT terraform1.11.0: data.vault_kv_secret_v2.signoz_clickhouse: Read complete after 0s [id=secret/data/signoz]
17:34:57.365 STDOUT terraform1.11.0: vault_policy.vso_reader: Refreshing state... [id=vso-reader]
17:34:57.373 STDOUT terraform1.11.0: vault_identity_group.developer[0]: Refreshing state... [id=f7e4fa30-a522-c524-6927-6e0f8c21d4f3]
17:34:57.377 STDOUT terraform1.11.0: vault_policy.kubero: Refreshing state... [id=kubero]
17:34:57.401 STDOUT terraform1.11.0: vault_policy.admin[0]: Refreshing state... [id=admin]
17:34:57.401 STDOUT terraform1.11.0: vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
17:34:57.402 STDOUT terraform1.11.0: vault_policy.default: Refreshing state... [id=default]
17:34:57.403 STDOUT terraform1.11.0: vault_identity_group.viewer[0]: Refreshing state... [id=89e06fbb-fc87-9471-ecc7-04b5747e4b06]
17:34:57.409 STDOUT terraform1.11.0: vault_mount.database: Refreshing state... [id=database]
17:34:57.411 STDOUT terraform1.11.0: kubernetes_namespace.kubero_operator_system: Preparing import... [id=kubero-operator-system]
17:34:57.411 STDOUT terraform1.11.0: vault_policy.developer[0]: Refreshing state... [id=developer]
17:34:57.411 STDOUT terraform1.11.0: kubernetes_namespace.observability: Preparing import... [id=observability]
17:34:57.412 STDOUT terraform1.11.0: vault_mount.kv: Refreshing state... [id=secret]
17:34:57.412 STDOUT terraform1.11.0: vault_policy.viewer[0]: Refreshing state... [id=viewer]
17:34:57.418 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_role.kubero: Refreshing state... [id=auth/kubernetes/role/kubero]
17:34:57.420 STDOUT terraform1.11.0: data.kubernetes_namespace.platform: Reading...
17:34:57.420 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/kubernetes/config]
17:34:57.421 STDOUT terraform1.11.0: kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system]
17:34:57.421 STDOUT terraform1.11.0: kubernetes_namespace.observability: Refreshing state... [id=observability]
17:34:57.430 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_role.vso: Refreshing state... [id=auth/kubernetes/role/vault-secrets-operator]
17:34:57.433 STDOUT terraform1.11.0: data.kubernetes_namespace.platform: Read complete after 0s [id=platform]
17:34:57.434 STDOUT terraform1.11.0: vault_kv_secret_v2.kubero: Refreshing state... [id=secret/data/kubero]
17:34:57.436 STDOUT terraform1.11.0: kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
17:34:57.439 STDOUT terraform1.11.0: kubernetes_config_map.homer_config[0]: Refreshing state... [id=platform/homer-config]
17:34:57.441 STDOUT terraform1.11.0: helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
17:34:57.441 STDOUT terraform1.11.0: data.kubernetes_secret.casdoor_builtin: Reading...
17:34:57.446 STDOUT terraform1.11.0: kubernetes_service.homer[0]: Refreshing state... [id=platform/homer]
17:34:57.449 STDOUT terraform1.11.0: helm_release.vault: Refreshing state... [id=vault]
17:34:57.491 STDOUT terraform1.11.0: data.kubernetes_secret.casdoor_builtin: Read complete after 0s [id=platform/casdoor-builtin-secret]
17:34:57.498 STDOUT terraform1.11.0: vault_policy.reader[0]: Refreshing state... [id=reader]
17:34:57.500 STDOUT terraform1.11.0: helm_release.signoz: Preparing import... [id=observability/signoz]
17:34:57.500 STDOUT terraform1.11.0: kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
17:34:57.698 STDOUT terraform1.11.0: helm_release.signoz: Refreshing state... [id=signoz]
17:34:57.782 STDOUT terraform1.11.0: data.vault_kv_secret_v2.kubero: Reading...
17:34:57.788 STDOUT terraform1.11.0: data.vault_kv_secret_v2.kubero: Read complete after 0s [id=secret/data/kubero]
17:34:57.788 STDOUT terraform1.11.0: kubernetes_namespace.kubero: Preparing import... [id=kubero]
17:34:57.789 STDOUT terraform1.11.0: helm_release.casdoor[0]: Refreshing state... [id=casdoor]
17:34:57.792 STDOUT terraform1.11.0: kubernetes_namespace.kubero: Refreshing state... [id=kubero]
17:34:57.800 STDOUT terraform1.11.0: kubernetes_deployment.homer[0]: Refreshing state... [id=platform/homer]
17:34:57.807 STDOUT terraform1.11.0: kubernetes_service_account.kubero: Preparing import... [id=kubero/kubero]
17:34:57.808 STDOUT terraform1.11.0: kubernetes_secret.kubero_secrets: Preparing import... [id=kubero/kubero-secrets]
17:34:57.809 STDOUT terraform1.11.0: kubernetes_secret.kubero_secrets: Refreshing state... [id=kubero/kubero-secrets]
17:34:57.812 STDOUT terraform1.11.0: kubernetes_s
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.